Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E32B.tmx
Source language: en_us
Languages: zh_cn

source: 5 Steps to Better Photography
zh_cn: 摄影入门五步走

source: Just like athletes, a photographer's skill comes from hours of training, accompanied by dedicated experimentation.
zh_cn: 运动员一样，一个摄影师的技能需要长时间的训练，还要做很多的实验。

source: By its nature, creative exploration means going beyond the easy and familiar.
zh_cn: 创造性的探索需要我们能够跳出容易和熟悉的套路。

source: Trying new tools or techniques, after initial frustration, can lead to great discoveries and open new ways of self-expression.
zh_cn: 尽管在尝试新工具和技术的初期我们有会一些挫折和沮丧，但我们会得到意外的发现和表达自我的新方式。

source: The goal is to come up with your own interpretation of the subject.
zh_cn: 我们的目标是以自己的方式来诠释主题。

source: This takes time, patience, and the discipline of using your eye to try to see beyond what is in front of you.
zh_cn: 这需要花费时间，付出耐心，你要训练自己去发现你面前主题更加深层的意义。

source: Below I listed 5 tools which, with practice, will help you to create strong sense of visual excitement in your images and ultimately to allow you to express the feelings that prompted you to take photographs in the first place.
zh_cn: 下面列出的五步可以让你拍摄的图片很有冲击力，并向你的观众表达你出你在图片现场的感觉和情绪，让他们感同身受。

source: Light
zh_cn: 1.光

source: Light is the most important aspect of photography.
zh_cn: 光是拍好一幅图片最重要的方面。

source: Understanding light will enable you to take advantage of any lighting situation. You can do that by studying your most successful photographs.
zh_cn: 深入了解光的特性能让你在各种光照条件下拍摄，你可以学习一些成功拍摄照片所采用的一些用光模式。

source: Look for the light and what it's doing in each of your images. Is it hard or soft, defuse or directional?
zh_cn: 拍照前先确定一下光源，它是硬的还是软的，是无向的还是有向的。

source: Look at the shadows, identify where the light is coming from.
zh_cn: 通过阴影来判断光是从哪里来的。

source: Become aware of light and its magic. On the field, use this knowledge to your advantage. Make the most of what is available.
zh_cn: 光可以给我们的照片注入魔力，要好好利用。

source: Colour
zh_cn: 2.颜色

source: Colour has an enormous impact on us. It can influence your mood and express your feelings.
zh_cn: 颜色对我们有很大的影响，它能够影响你的情绪和表达你的感觉。

source: Learn some basic principles of colour theory. Familiarize yourself with the 4 basic dimensions of colour: hue, value, intensity and temperature.
zh_cn: 学习一个基本的颜色原理，熟悉颜色的四个基本的维度：色调，明暗，强度和色温。

source: Discover the secret language of colour and its meaning. Using colour concisely will help you to create interesting compositions.
zh_cn: 发现颜色的秘密语言和它的意义，准确用光能让你创造出有趣的构图。

source: Abstraction
zh_cn: 3.抽象

source: Everything you photograph is composed of shapes. You cannot photograph a tree, you can only photograph a form and colour that conveys the visual information of a tree.
zh_cn: 你拍摄的图片都是由形状组成的，你无法拍摄一棵真正的树，你只能通过拍摄树的形状和颜色来传达一棵树的视觉信息。

source: Therefore, it is important for you as a photographer to be able to see subjects as shapes. Train yourself to break down the scene in front of you into areas of simple shapes and colour. It will help you to create simple composition with a clear message.
zh_cn: 因此，作为一个摄影师，很重要的一点，你需要训练自己把眼前的景象划分为简单的形状和颜色区域，这能帮助你创建一个清晰简洁的构图。

source: Elements of design
zh_cn: 4.图形元素设计

source: The elements of design are the building blocks used to create a work of art.
zh_cn: 图形元素是创造艺术品的原材料。

source: The most basic element in any photograph is lines.
zh_cn: 摄影中最基本的元素是线。

source: Being conscious of the subtle feelings associated with lines will allow you to manipulate a photograph's emotional impact.
zh_cn: 能够意识到与线关联的微妙感觉能够让你找到一幅图片所能表达出来的情绪。

source: For example a horizontal line suggests calmness and tranquility, a vertical line gives a feeling of balance, oblique suggests movement.
zh_cn: 比如水平线能够传达出平静和安宁，垂直线表达出平衡的情绪，而斜线表明运动。

source: To create more effective photographs, actively look for lines and arrange them within your viewfinder to evoke specific feelings.
zh_cn: 要创造更为生动的图片，你需要积极的寻找线并把他们搭配好来传达特定的感觉。

source: Techniques
zh_cn: 5.技术

source: Techniques are important to the success of any photograph(s).
zh_cn: 技术是一幅图片成功的非常重要的因素。

source: You should practice to the point that they become second nature. Then you will have the freedom to create.
zh_cn: 你应该不断的尝试训练让它变成你的第二天性，然后你的创造力就不会受到限制。

source: But remember, techniques should not detract from what you are trying to communicate. They are there to help you make that message clearer. It can become a pointless exercise where there is too much reliance on technique.
zh_cn: 但要谨记不能让技术扰乱你想要在图片中要表达的主题，它应该让你把主题变得更清晰，如果你过于依赖技术，那它就失去了原来的意义。

source: There you have it: 5 simple steps to better photography.
zh_cn: 这就是拍好图片的五个简单的步骤。

source: Now, go and create, experiment and most of all have fun.
zh_cn: 现在你可以去创造，体验并体会其中的乐趣了。

source: And don't be afraid of making mistakes.
zh_cn: 不要害怕犯错误。

source: As Garry Marshall once said "It's always helpful to learn from your mistakes because then your mistakes seem worthwhile. "
zh_cn: 就像Garry Marshall曾经说过从你犯的错误中学习，那这些错误就会变得有价值。
